{"text": "Leadership and communication skills - to build and strengthen relationships both within and outside the organization.", "soft skill": "yes"}
{"text": "Strong communication and collaboration skills.", "soft skill": "yes"}
{"text": "Teamwork skills with a problem-solving attitude", "soft skill": "yes"}
{"text": "Like to work with other talented and awesome people!", "soft skill": "yes"}
{"text": "written and oral communication skills The desire to be a part of a team that's just as passionate as you", "soft skill": "yes"}
{"text": "If you are a creative problem solver and have an insatiable appetite for learning, come join our team!", "soft skill": "yes"}
{"text": "Make suggestions for better solutions to problems", "soft skill": "yes"}
{"text": "Communication: Clearly convey information and ideas through a variety of media to individuals or groups in a manner that engages the audience and helps them understand and retain the message.", "soft skill": "yes"}
{"text": "Effective oral and written communication skills.", "soft skill": "yes"}
{"text": "You are committed to quality and thoroughness", "soft skill": "yes"}
{"text": "Detailed problem solving skills, documentation, communication and flexibility", "soft skill": "yes"}
{"text": "Independently propose and create solutions.", "soft skill": "yes"}
{"text": "Strong communication skills.", "soft skill": "yes"}
{"text": "Self-motivated, a go-getter, and have previous internship experience.", "soft skill": "yes"}
{"text": "Demonstrated leadership potential", "soft skill": "yes"}
{"text": "Effective oral, written, and interpersonal communication skills", "soft skill": "yes"}
{"text": "A willingness to learn", "soft skill": "yes"}
{"text": "You are curious, persistent, logical and clever.", "soft skill": "yes"}
{"text": "Strong written, oral, and interpersonal communication skills.", "soft skill": "yes"}
{"text": "Ability to work both independently and in a team-oriented, collaborative environment.", "soft skill": "yes"}
{"text": "Must be able to work with autonomy", "soft skill": "yes"}
{"text": "Ability to communicate across disciplines.", "soft skill": "yes"}
{"text": "We're always trying new things and you should too.", "soft skill": "yes"}
{"text": "You have shown success in practical problem solving and strong communication", "soft skill": "yes"}
{"text": "Good problem-solving skills", "soft skill": "yes"}
{"text": "Strong problem-solving skills", "soft skill": "yes"}
{"text": "You have proven interpersonal skills, motivated, self-starter, and ability to work in a global environment.", "soft skill": "yes"}
{"text": "This demonstrates that you're interested in collaboration.", "soft skill": "yes"}
{"text": "You can debate with empathy.", "soft skill": "yes"}
{"text": "You can keep your eye on the goal while communicating early and often throughout a sprint.", "soft skill": "yes"}
{"text": "Skill in attention to detail.", "soft skill": "yes"}
{"text": "Ability to take the initiative to learn and research new concepts, ideas, and technologies.", "soft skill": "yes"}
{"text": "Ability to maintain confidentiality.", "soft skill": "yes"}
{"text": "A proven track record: you've driven projects to completion and can speak to the impact for the business or the customer", "soft skill": "yes"}
{"text": "Clear and accurate written and verbal communication skills.", "soft skill": "yes"}
{"text": "Job Description and Requirements:", "soft skill": "no"}
{"text": "This is an exciting opportunity to join the Center of Customer Excellence team as a Frontend Application Engineer (AE).", "soft skill": "no"}
{"text": "Drive successful business engagements, competitive situations, customer tapeouts and collaborations to showcase and deploy Synopsys' latest technologies.", "soft skill": "no"}
{"text": "Drive R&D product roadmaps and improvements.", "soft skill": "no"}
{"text": "Present product updates and lead discussions in areas of expertise.", "soft skill": "no"}
{"text": "The job involves working closely with users/customers and multiple organizations like R&D, marketing, sales among others.", "soft skill": "no"}
{"text": "AEs are expected to manage multiple customer activities concurrently, and work with Sales and AE Management to set priorities.", "soft skill": "no"}
{"text": "/MSEE with 3+ years of experience working on advanced process node flows.", "soft skill": "no"}
{"text": "Formal Verification experience is optional.", "soft skill": "no"}
{"text": "Working knowledge of scripting languages like Unix, Perl and TCL.", "soft skill": "no"}
{"text": "Customer sensitivity and the ability to multiplex issues & set priorities are essential for success in the position.", "soft skill": "yes"}
{"text": "Strong verbal and written communication skills are mandatory.", "soft skill": "yes"}
{"text": "Some travel may be required.", "soft skill": "no"}
{"text": "Locations:", "soft skill": "no"}
{"text": "Austin, TX or Marlborough, MA", "soft skill": "no"}
{"text": "Engineering", "soft skill": "no"}
{"text": "Employee", "soft skill": "no"}
{"text": "Country", "soft skill": "no"}
{"text": "United States", "soft skill": "no"}
{"text": "Our company is looking for a Web Developer who will be performing following roles and responsibilities: Collaborate with architects, senior developers to develop enterprise applications, including development of User Interface (UI) components and complex web applications.", "soft skill": "no"}
{"text": "Translate designs and wireframes into high quality code.", "soft skill": "no"}
{"text": "Develop complex web applications with the help Angular and develop custom reusable components.", "soft skill": "no"}
{"text": "Minimum Requirements Bachelor's Degree in Computer Science/ Information Technology or closely related field.", "soft skill": "no"}
{"text": "Please mail the resume at Alpha Clinical Systems,", "soft skill": "no"}
{"text": "Inc. JOB# SJ1019, 15 Corporate Place South, Suite#420, Piscataway, NJ 08854.", "soft skill": "no"}
{"text": "Requirements", "soft skill": "no"}
{"text": "React Javascript with knowledge of Redux state container", "soft skill": "no"}
{"text": "Node.js knowledge preferred  Experience in Cloud development preferred  Microservices preferred", "soft skill": "no"}
{"text": "Job Category", "soft skill": "no"}
{"text": "Products and Technology", "soft skill": "no"}
{"text": "Job Details", "soft skill": "no"}
{"text": "Salesforce is looking for a strong front end developer to join Team Trailhead to focus on  myTrailhead  .", "soft skill": "no"}
{"text": "Learn  more how myTrailhead  connects  communities on our website here", "soft skill": "no"}
{"text": ", may be even  earn  a couple badges on there and show it off on your profile!", "soft skill": "no"}
{"text": "We are assembling a team that will focus on the myTrailhead customers requirements.", "soft skill": "no"}
{"text": "Our current tech stack is Ruby on Rails, Node.js, jQuery and React deployed on Heroku.", "soft skill": "no"}
{"text": "You will lead the frontend features' design and execution on this team.", "soft skill": "no"}
{"text": "Trailhead is a distributed team and we work in a collaborative environment.", "soft skill": "no"}
{"text": "We value transparent communication and feedback, code reviews, and making learning fun.", "soft skill": "yes"}
{"text": "Responsibilities:", "soft skill": "no"}
{"text": "Collaborate with technical architect and peers to design and document new features for myTrailhead customers.", "soft skill": "no"}
{"text": "Drive the innovative design solutions and choice of technology and tools to build efficient and consistent features.", "soft skill": "no"}
{"text": "Build features by writing maintainable code and know when to apply unit, functional, and integration tests.", "soft skill": "no"}
{"text": "Collaborate with engineering manager, product manager and the UX team to understand customer requirements, product backlog, technical debt, dependencies.", "soft skill": "no"}
{"text": "Guide and mentor engineering staff through code reviews and pairing.", "soft skill": "no"}
{"text": "Minimum Qualifications:", "soft skill": "no"}
{"text": "Several years experience with object oriented programming.", "soft skill": "no"}
{"text": "Professional experience with Javascript, Node.js, React.", "soft skill": "no"}
{"text": "Strong technical design and abstraction skills.", "soft skill": "no"}
{"text": "You write technical designs/test plans and test content for your area and act as technical reviewer for others.", "soft skill": "no"}
{"text": "You are a strong communicator who is proactive and can explain complex technical concepts simply to a diverse set of audiences.", "soft skill": "no"}
{"text": "Consistent track record of delivering on commitments.", "soft skill": "no"}
{"text": "Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers.", "soft skill": "no"}
{"text": "Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status.", "soft skill": "no"}
{"text": "Headhunters and recruitment agencies may not submit resumes/CVs through this Web site or directly to managers.", "soft skill": "no"}
{"text": "Job ID:   1213", "soft skill": "no"}
{"text": "Position:   Developer", "soft skill": "no"}
{"text": "Location:   Los Angeles, CA  Practice Area:", "soft skill": "no"}
{"text": "Open Date:   Tuesday, October 8, 2019", "soft skill": "no"}
{"text": "Job Type:", "soft skill": "no"}
{"text": "Staff", "soft skill": "no"}
{"text": "Job Description:", "soft skill": "no"}
{"text": "O'Melveny has an immediate opening for a Web Developer.", "soft skill": "no"}
{"text": "This position will also work closely with other IT teams in the review and recommendation of applications based on practice group needs and provide technical support for problems encountered at both user level and internal IT related issues.", "soft skill": "no"}
{"text": "The successful candidate must possess excellent communication skills, as well as have the ability to explain design decisions.", "soft skill": "yes"}
{"text": "Must also have strong analytical and programming skills in ASP.Net, C#, XML, XSLT, Javascript, as well as strong knowledge of SQL and the ability to design project specific databases and schemas and SQL objects.", "soft skill": "no"}
{"text": "Ideal candidate will actively pursue new technologies, have a curiosity and passion for crafting amazing user experiences and have familiarity with and adherence to web standards and best practices.", "soft skill": "yes"}
{"text": "Job Requirements:", "soft skill": "no"}
{"text": "Qualifications:", "soft skill": "no"}
{"text": "Minimum of 3 years experience with applications and system development procedures and tools, as well as experience with industry coding standards, source code management using Team Foundation Server and product lifecycle methodologies.", "soft skill": "no"}
{"text": "Experience with Content Management Systems", "soft skill": "no"}
{"text": "; Sitecore experience is a plus.", "soft skill": "no"}
{"text": "Experience with enterprise search platforms (Apache Solr, OpenText Decisiv search) and experience coding to application APIs and Web Services.", "soft skill": "no"}
{"text": "Familiarity with all aspects of full Software Development Life Cycle (SDLC) is also helpful.", "soft skill": "no"}
{"text": "Experience with legal applications and with relevant mobile development frameworks and/or", "soft skill": "no"}
{"text": "Visual design skills and an eye for layout and typography are a plus as well.", "soft skill": "no"}
{"text": "A bachelor's degree in computer science or related field is preferred.", "soft skill": "no"}
{"text": "For more information, or to be considered for this position, please apply online at www.omm.com .", "soft skill": "no"}
{"text": "At AKQA we believe in the imaginative application of art and science to create beautiful ideas, products and services.", "soft skill": "no"}
{"text": "Front-end Developers at AKQA have a strong dedication to recent and upcoming technologies, as well as the drive to develop innovative technical solutions.", "soft skill": "no"}
{"text": "The Front-end Developer will participate in the creation of sophisticated digital experiences and must have advanced understanding of front-end web development.", "soft skill": "no"}
{"text": "Candidates for this role must be available to work on-site in Sunnyvale, CA.", "soft skill": "no"}
{"text": "Must have at least 3 + years of experience working as a front-end developer", "soft skill": "no"}
{"text": "In-depth knowledge of HTML, CSS and JavaScript, and other web development/production tools", "soft skill": "no"}
{"text": "Proficient in JavaScript with an emphasis on Vanilla JS rather than helper libraries or frameworks", "soft skill": "no"}
{"text": "Strong knowledge responsive web design", "soft skill": "no"}
{"text": "Experience with translating comps and wireframes into flexible and usable code", "soft skill": "no"}
{"text": "Experience with version control software", "soft skill": "no"}
{"text": "Experience with Photoshop", "soft skill": "no"}
{"text": "Experience with developing large customer-facing websites", "soft skill": "no"}
{"text": "QUALITIES AND CHARACTERISTICS", "soft skill": "no"}
{"text": "Eager to work in a fast-paced and dynamic environment", "soft skill": "yes"}
{"text": "Experience with web application development", "soft skill": "no"}
{"text": "Able to articulate their ideas to your team", "soft skill": "yes"}
{"text": "Thrives when facing new challenges in improving client deliverables", "soft skill": "yes"}
{"text": "Excellent verbal and written communication skills and able to interact professionally with a diverse group of people", "soft skill": "yes"}
{"text": "Strong oral and written English communication skills", "soft skill": "yes"}
{"text": "Boundlessly creative and relentlessly attentive to detail", "soft skill": "yes"}
{"text": "Your race, colour, ancestry, religion, gender, gender identity, national origin, sexual orientation, age, marital status, disability or veteran status have no bearing on our hiring decisions.", "soft skill": "no"}
{"text": "If you have a disability or special need that requires accommodation, please let us know.", "soft skill": "no"}
{"text": "Job Description:", "soft skill": "no"}
{"text": "DELTA Resources is seeking a Junior Software developer to join our Cloud,Cyber, and Data Analytics team at our Corporate Headquarters office in Alexandria, VA.", "soft skill": "no"}
{"text": "This is an entry-level to junior position in DoD cloud computing/DevSecOps that offers outstanding opportunities for learning and career advancement.", "soft skill": "no"}
{"text": "Ideal candidates will have strong technical aptitude, hands on programming capability, curiosity, and desire to build cool innovative tools while working as part of an Agile Scrum team.", "soft skill": "no"}
{"text": "This position involves work in a mixed Windows/Linux/AWS Cloud environment supporting DoD Level 5/Level 2 cloud architectures.", "soft skill": "no"}
{"text": "Primary Responsibilities:", "soft skill": "no"}
{"text": "Develop, convert, and migrate applications from legacy platforms using a variety of programming languages.", "soft skill": "no"}
{"text": "Collaborate to design, code, test, and validate applications following CMMI Level 3 practices", "soft skill": "no"}
{"text": "Support the team with all other duties as assigned.", "soft skill": "no"}
{"text": "Job Requirements:", "soft skill": "no"}
{"text": "Bachelor's degree or combination of coursework and work experience in tech related field.", "soft skill": "no"}
{"text": "Ability to obtain a DoD Secret security clearance.", "soft skill": "no"}
{"text": "Excellent problem solving skills.", "soft skill": "no"}
{"text": "Solid HTML, CSS, and", "soft skill": "no"}
{"text": "JavaScript skills with 4 or 3GL programming experience and demonstrated programming skills in a current scripting language - (for example)", "soft skill": "no"}
{"text": "Angular, Python, Perl, Ruby, Go, JQuery, Node.JS.", "soft skill": "no"}
{"text": "Preferred Skills:", "soft skill": "no"}
{"text": "Working knowledge of Linux and facility with command line.", "soft skill": "no"}
{"text": "Math, statistics, or analytics a strong plus.", "soft skill": "no"}
{"text": "Familiarity with modern DevOps principles, methods, and tools a plus.", "soft skill": "no"}
{"text": "Understanding of modern JavaScript applications and web pages, Single Page Web applications, Micro-services, and Containerization are all pluses.", "soft skill": "no"}
{"text": "Bachelor's degree in Computer Science or related field, or equivalent practical experience.", "soft skill": "no"}
{"text": "Experience in developing technical strategy, and architecting large front-end solutions. 0", "soft skill": "no"}
{"text": "-4 years experience of software development and deployment of distributed multi-tier applications across web, mobile-web and apps.", "soft skill": "no"}
{"text": "Front-End technologies: HTML, CSS, JavaScript, templating languages, view", "soft skill": "no"}
{"text": "frameworks [e.g., Angular.js] etc.", "soft skill": "no"}
{"text": "This opportunity is for a Front End Engineer I who will serve as a Front End developer for Audible's Consumer Domains group.", "soft skill": "no"}
{"text": "We are the home for tech talent that wants to grow Audible's market leading business and build the sites and services (APIs) across desktop and mobile devices.", "soft skill": "no"}
{"text": "The team is comprised of developers who work in an agile environment and partner closely with Audible and Amazon tech teams, Product, UX and QA teams.", "soft skill": "no"}
{"text": "We are embarking on a mission to reshape the fundamental experiences and delight our customers and drive a strong engineering culture.", "soft skill": "no"}
{"text": "It's our responsibility to push Audible into new places; wherever our customers are listening.", "soft skill": "no"}
{"text": "Achieving this vision means expanding and strengthening our development process and leveraging new technologies to deliver services and web applications.", "soft skill": "no"}
{"text": "We need your help to develop and deliver on this vision.", "soft skill": "no"}
{"text": "Success means we lay the foundation for continued expansion of our company without disrupting an already tremendously successful and much loved project.", "soft skill": "no"}
{"text": "HOW DOES AMAZON FIT IN?", "soft skill": "no"}
{"text": "We're a part of Amazon: they are our parent company and it's a great partnership.", "soft skill": "no"}
{"text": "Audible is built on a strong foundation of Amazon technology and you'll have insight into the inner workings of the world's leading ecommerce experience.", "soft skill": "no"}
{"text": "There's a LOT to learn!", "soft skill": "no"}
{"text": "Your career will benefit from working with teams like Search, A9, Kindle, P13N, Alexa and many more.", "soft skill": "no"}
{"text": "Adopt best practices in software engineering: design, testing, version control, documentation, build, deployment, and operations.", "soft skill": "no"}
{"text": "Design and implement key initiatives and major features from the front end client down through the underlying services powering it.", "soft skill": "no"}
{"text": "Participate in the full development life cycle, working within broadly defined parameters.", "soft skill": "no"}
{"text": "Constantly strive to raise the bar on front-end engineering excellence and working to ensure high performance of our sites and accessibility of our content.", "soft skill": "no"}
{"text": "Lead the way - staying up to date with tools, trends, technologies and frameworks both industry-wide and within Amazon and then sharing that knowledge in a meaningful way with the community.", "soft skill": "no"}
{"text": "Outstanding interpersonal skills and the ability to work effectively across teams & multiple division stakeholders.", "soft skill": "yes"}
{"text": "Proven success in mentoring tech leads and engineers.", "soft skill": "no"}
{"text": "History of delivering customer-driven software products at a high scale in a fast paced, technology first, rapid-growth company.", "soft skill": "no"}
{"text": "Prior success as a strategic influencer on the direction of product design and development.", "soft skill": "no"}
{"text": "Outstanding interpersonal skills and the ability to work effectively across teams & multiple division stakeholders.", "soft skill": "yes"}
{"text": "Output is seeking a Jr. Web Developer to join the Web Development Team to play an active role in the creation, execution, management and maintenance of Output's various web properties and services.", "soft skill": "no"}
{"text": "The Jr. Web Developer will work closely with nearly every department including marketing, product, operations, and design, ensuring each department's needs are met on Output.com.", "soft skill": "no"}
{"text": "Responsibilities", "soft skill": "no"}
{"text": "Build one-off web pages in WordPress.", "soft skill": "no"}
{"text": "Work alongside the design team to build and edit web pages.", "soft skill": "no"}
{"text": "Work alongside the marketing team to edit and consult on web-related work.", "soft skill": "no"}
{"text": "Work with web development to plan and execute revisions to the company's sites.", "soft skill": "no"}
{"text": "Ensure company site is fully functional at all times and quickly fix issues.", "soft skill": "no"}
{"text": "Requirements", "soft skill": "no"}
{"text": "Experience with WordPress themes, plugins, and WooCommerce.", "soft skill": "no"}
{"text": "Experience in building functional front-facing webpages, with a keen eye for design/details and SEO best practices.", "soft skill": "no"}
{"text": "Experience reading design documents (PSD, Zeplin, Sketch, etc.) and extracting assets.", "soft skill": "no"}
{"text": "Proficiency with front-end coding and debugging.", "soft skill": "no"}
{"text": "Understands and applies principles of page optimization, such as media queries, asynchronous loading, and caching.", "soft skill": "no"}
{"text": "Strong understanding of ES6, jQuery, HTML5, CSS3, AJAX, CSS frameworks (eg Bootstrap), version control (Git/Github).", "soft skill": "no"}
{"text": "Strong written and verbal communication skills.", "soft skill": "yes"}
{"text": "Submit Your Application", "soft skill": "no"}
{"text": "You have successfully applied", "soft skill": "no"}
{"text": "Apply With Resume *", "soft skill": "no"}
{"text": "First Name", "soft skill": "no"}
{"text": "*", "soft skill": "no"}
{"text": "Middle Name", "soft skill": "no"}
{"text": "Last Name", "soft skill": "no"}
{"text": "*", "soft skill": "no"}
{"text": "Mobile", "soft skill": "no"}
{"text": "Social Network and Web Links", "soft skill": "no"}
{"text": "+", "soft skill": "no"}
{"text": "Optional: Skip the cover letter and tell us why you're the best person for the job.", "soft skill": "no"}
{"text": "Attach a file < 2 MB", "soft skill": "no"}
{"text": "Flywheel is looking for a design-minded software engineer with front-end development experience to join our rapidly growing development team.", "soft skill": "no"}
{"text": "This job will include a lot of front-end development (JavaScript, CSS) and some back-end development (Ruby).", "soft skill": "no"}
{"text": "You'll be responsible for developing all aspects of the Flywheel software stack but you will mainly focus on ensuring our software is beautiful and easy to use.", "soft skill": "no"}
{"text": "You will work with our design and engineering teams to maintain almost-flawless functionality, and add brilliant, brand new features.", "soft skill": "no"}
{"text": "At IBM, work is more than a job - it's a calling: To build.", "soft skill": "no"}
{"text": "To design.", "soft skill": "no"}
{"text": "To consult.", "soft skill": "no"}
{"text": "To think along with clients and sell.", "soft skill": "no"}
{"text": "To make markets.", "soft skill": "no"}
{"text": "To collaborate.", "soft skill": "no"}
{"text": "Not just to do something better, but to attempt things you've never thought possible.", "soft skill": "no"}
{"text": "Are you ready to lead in this new era of technology and solve some of the world's most challenging problems?", "soft skill": "no"}
{"text": "If so, lets talk.", "soft skill": "no"}
{"text": "Your Role and Responsibilities", "soft skill": "no"}
{"text": "This is a unique and exciting opportunity within IBM's Garage Method & Architecture Center web development team.", "soft skill": "no"}
{"text": "As a key member of this content squad, you will use your editorial, content development, video, and content production expertise to grow the engagement and views of the site.", "soft skill": "no"}
{"text": "IBM Garage Method and Cloud Architecture sites are key to communicating IBM's POV to a technical audience.", "soft skill": "no"}
{"text": "We're seeking a digital content and video developer who will work across the content squad as a writer and video script and production expert.", "soft skill": "no"}
{"text": "You will work with a variety of stakeholders across IBM and use their talent to help IBM in its goal to grow enterprise mindshare through our digital presence.", "soft skill": "no"}
{"text": "You will work with our stakeholders, our infrastructure squad, and our content squad and leadership to help produce content and deliver to the site.", "soft skill": "no"}
{"text": "Create value content for Garage Method & Cloud Architecture sites", "soft skill": "no"}
{"text": "Produce engaging content that encourages further exploration", "soft skill": "no"}
{"text": "Keep current on industry trends across subject areas, working with acquisition editors to spot trends and ensure we provide coverage for them.", "soft skill": "no"}
{"text": "Function as a core member of a high-performing, agile team using tools like Git, markdown, HTML, JavaScript, Video production tools, Visual design tools like Sketch, Photoshop, etc.", "soft skill": "no"}
{"text": "Technical communication (technical content development) 1 year", "soft skill": "no"}
{"text": "Video scripting and creation 1 year", "soft skill": "no"}
{"text": "Visual design 1 year", "soft skill": "no"}
{"text": "Preferred Technical and Professional Expertise", "soft skill": "no"}
{"text": "Web development (html, markdown, javascript) 1 year", "soft skill": "no"}
{"text": "Interview skills", "soft skill": "yes"}
{"text": "About Business Unit", "soft skill": "no"}
{"text": "IBM Cloud provides the security, control, and visibility that our clients have come to expect.", "soft skill": "no"}
{"text": "We are working to provide the right tools and environment to combine all of our client's data, no matter where it resides, to respond to changing market dynamics.", "soft skill": "no"}
{"text": "What matters to you when you're looking for your next career challenge?", "soft skill": "no"}
{"text": "Maybe you want to get involved in work that really changes the world?", "soft skill": "no"}
{"text": "What about somewhere with incredible and diverse career and development opportunities - where you can truly discover your passion?", "soft skill": "no"}
{"text": "What about all of these?", "soft skill": "no"}
{"text": "If so, then IBM could be your next career challenge.", "soft skill": "no"}
{"text": "Join us, not to do something better, but to attempt things you never thought possible.", "soft skill": "no"}
{"text": "Impact.", "soft skill": "no"}
{"text": "Inclusion.", "soft skill": "no"}
{"text": "Infinite Experiences.", "soft skill": "no"}
{"text": "Do your best work ever.", "soft skill": "no"}
{"text": "We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action.", "soft skill": "no"}
{"text": "IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition.", "soft skill": "no"}
{"text": "Location Statement", "soft skill": "no"}
{"text": "For additional information about location requirements, please discuss with the recruiter following submission of your application.", "soft skill": "no"}
{"text": "Being You @ IBM", "soft skill": "no"}
{"text": "IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer.", "soft skill": "no"}
{"text": "IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.", "soft skill": "no"}
{"text": "In this position, you will become a member of a small development team providing quality software solutions to DoD customers.", "soft skill": "no"}
{"text": "You must be eligible to obtain a DOD Security clearance, which requires a US citizen.", "soft skill": "no"}
{"text": "We develop software to support management of our nation's DoD installations.", "soft skill": "no"}
{"text": "What you will do...", "soft skill": "no"}
{"text": "Apply and grow your expertise and experience in full life-cycle support while designing developing, documenting, testing, and deploying business management applications", "soft skill": "no"}
{"text": "Work in small to medium size teams to develop on-line applications that are deployed in a cloud environment to users across the world", "soft skill": "no"}
{"text": "Adhere to sound software development processes and participate in an agile environment where high quality delivery is an expectation", "soft skill": "no"}
{"text": "Work with government stakeholders to design, develop, integrate, and test solutions for business requirements", "soft skill": "no"}
{"text": "Use development tools to track your tasks, manage code changes, and document your work", "soft skill": "no"}
{"text": "Have access to on-line training to further your knowledge in technology", "soft skill": "no"}
{"text": "You would be a great fit if you have...", "soft skill": "no"}
{"text": "A Bachelor's degree in Computer Science, Information Technology, Engineering, or other related technical field with 2+ years of relevant experience", "soft skill": "no"}
{"text": "2+ years of experience with SQL, JavaScript, HTML, CSS", "soft skill": "no"}
{"text": "2+ years developing new software and/or troubleshooting and enhancing existing software", "soft skill": "no"}
{"text": "Experience with object-oriented concepts and programming", "soft skill": "no"}
{"text": "Experience with web development frameworks, database technologies, web services, web application servers", "soft skill": "no"}
{"text": "It would be even better if you have...", "soft skill": "no"}
{"text": "Experience with Ext JS framework, Rest, XML, JSON", "soft skill": "no"}
{"text": "Experience with server page technologies such as PHP, ASP, JSP, ColdFusion", "soft skill": "no"}
{"text": "Experience with Atlassian tools such as Jira, and Confluence", "soft skill": "no"}
{"text": "Experience with configuration management, automated build and continuous integration tools such as SVN, ANT, Jenkins", "soft skill": "no"}
{"text": "Experience with automated testing tools such as Selenium, JUnit, Katalon", "soft skill": "no"}
{"text": "Ability to solve problems while adapting and learning new technologies and concepts", "soft skill": "yes"}
{"text": "Ability to perform as a positive, self-motivated, independent, detail oriented, and responsible team-player", "soft skill": "yes"}
{"text": "Strong written and oral communication skills", "soft skill": "yes"}
{"text": "This position requires the candidate to be able to obtain and maintain a Secret security clearance.", "soft skill": "no"}
{"text": "What you'll get...", "soft skill": "no"}
{"text": "An immediately-vested 401(K) with employer matching", "soft skill": "no"}
{"text": "Rapid PTO accrual schedule with floating holidays", "soft skill": "no"}
{"text": "Comprehensive medical, dental, and vision coverage", "soft skill": "no"}
{"text": "Tuition assistance, financing, and refinancing", "soft skill": "no"}
{"text": "Paid maternity and paternity leave", "soft skill": "no"}
{"text": "Company-paid infertility treatments", "soft skill": "no"}
{"text": "Cross-training and professional development opportunities", "soft skill": "no"}
{"text": "We are an Equal Opportunity/Affirmative Action Employer.", "soft skill": "no"}
{"text": "We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law.", "soft skill": "no"}
{"text": "Koddi is looking for a Front End Web Developer with a knack for communication and an eye for design to join our growing engineering team.", "soft skill": "no"}
{"text": "As a Front End Developer, you will apply the principles and techniques of user experience to develop actionable designs to meet the desired functionality of our stakeholders and integrate these designs into our development process.", "soft skill": "no"}
{"text": "Who you are", "soft skill": "no"}
{"text": "Experience designing REST endpoints", "soft skill": "no"}
{"text": "Develop a world-class UI ensuring alignment between web design and UX requirements", "soft skill": "no"}
{"text": "You have experience with modern JavaScript frameworks such as React, Angular or Vue", "soft skill": "no"}
{"text": "You have a deep understanding of SPA (single page application) architecture of the website", "soft skill": "no"}
{"text": "You have a strong ability to translate requirements into software", "soft skill": "no"}
{"text": "You have competence with logical and technical problem solving", "soft skill": "no"}
{"text": "You are committed to quality and thoroughness", "soft skill": "yes"}
{"text": "You're organized and manage your time well", "soft skill": "yes"}
{"text": "You have a passion for learning new technologies", "soft skill": "yes"}
{"text": "What you'll do...", "soft skill": "no"}
{"text": "Take an existing application architecture and use best practices to create UI to product specifications", "soft skill": "no"}
{"text": "You are a strong advocate for User Experience and back it up with effective execution", "soft skill": "no"}
{"text": "You will create and maintain frontend style guide including the site organization, page layout, navigation, style sheets, graphical elements, fonts, color palette, frontend application folder structure, and coding conventions", "soft skill": "no"}
{"text": "You'll evaluate new or best architecture practices", "soft skill": "no"}
{"text": "You'll create mockups and wireframes from project requirements", "soft skill": "no"}
{"text": "You will ensure designs are consistent across browsers and device types", "soft skill": "no"}
{"text": "You will analyze and execute user experience improvement through qualitative methods", "soft skill": "no"}
{"text": "You'll collaborate with the product team and product managers to improve existing functionality and bring new ideas to life", "soft skill": "no"}
{"text": "You'll assist with interviewing, on-boarding, and training frontend engineers as they join the team", "soft skill": "no"}
{"text": "Who we are", "soft skill": "no"}
{"text": "Forging a better path for travelers through integrity, insights, inclusivity, and innovation.", "soft skill": "no"}
{"text": "Getting the experience right, together.", "soft skill": "no"}
{"text": "Koddi is a cloud provider of marketing technology for travel brands.", "soft skill": "no"}
{"text": "Our partners leverage the Koddi platform and its fully automated and customizable reporting features to manage marketing investment for hundreds of thousands of hotel properties globally.", "soft skill": "no"}
{"text": "Title:", "soft skill": "no"}
{"text": "Front End Developer", "soft skill": "no"}
{"text": "Type:", "soft skill": "no"}
{"text": "Direct Hire", "soft skill": "no"}
{"text": "Location:", "soft skill": "no"}
{"text": "Portland Metro", "soft skill": "no"}
{"text": "Primary Functions:", "soft skill": "no"}
{"text": "Work with data, document, design, and code.", "soft skill": "no"}
{"text": "3+ years of professional front-end development experience", "soft skill": "no"}
{"text": "CSS3, HTML5, ES2015+, and responsive design", "soft skill": "no"}
{"text": "Experience with JavaScript application libraries and frameworks, such as Ember, Vue, Angular, Angular", "soft skill": "no"}
{"text": "Experience with NPM, NodeJS, and build tools such as Webpack, Gulp, or Grunt", "soft skill": "no"}
{"text": "Experience with client-side testing, including with libraries such as Mocha, Jasmine, or Jest.", "soft skill": "no"}
{"text": "Experience developing and consuming JSON/RESTful service APIs.", "soft skill": "no"}
{"text": "Experience integrating with Java, JSF, Spring applications preferred.", "soft skill": "no"}
{"text": "Low Latency Recruiting is an equal opportunity employer.", "soft skill": "no"}
{"text": "Low Latency Recruiting does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, disability status, or any other basis covered by local, state or federal law.", "soft skill": "no"}
{"text": "Overview", "soft skill": "no"}
{"text": "This Web Developer is accountable for ensuring global E - Business/Commerce platforms are well controlled, operating effectively and aligned with business needs.", "soft skill": "no"}
{"text": "Responsibilities", "soft skill": "no"}
{"text": "Breaks down features into manageable stories to allow for easier coding, reviewing, testing and approval", "soft skill": "no"}
{"text": "Participates in retrospectives to gain knowledge and learning with the purpose to become a more effective team member and to build better teams and deliver continuing higher quality products", "soft skill": "no"}
{"text": "Writes clean, readable, adaptable and quality unit tests alongside production code", "soft skill": "no"}
{"text": "Reviews others code to ensure delivery of high-quality functionality and participate in an environment of learning", "soft skill": "no"}
{"text": "Focuses on continuous integration and/or continuous delivery strategies providing optimal feedback loops for the team", "soft skill": "no"}
{"text": "Builds test automation and practices test driven development", "soft skill": "no"}
{"text": "Achieves the goals defined by the stakeholders", "soft skill": "no"}
{"text": "May work to influence parties within own job function at an operational level.", "soft skill": "no"}
{"text": "Works to achieve operational targets within job area with direct impact on department results.", "soft skill": "no"}
{"text": "Works independently on larger, moderately complex projects/ assignments.", "soft skill": "no"}
{"text": "Sets objectives for own job area to meet the objectives or goals of projects and assignments.", "soft skill": "no"}
{"text": "Qualifications", "soft skill": "no"}
{"text": "Minimum Education and Experience Required:", "soft skill": "no"}
{"text": "BS/BA in Computer Science or related field or equivalent experience", "soft skill": "no"}
{"text": "Magento 2x (1 year)", "soft skill": "no"}
{"text": "PHP (3 years)", "soft skill": "no"}
{"text": "JavaScript (3 years)", "soft skill": "no"}
{"text": "Understanding of client-side scripting and JavaScript frameworks", "soft skill": "no"}
{"text": "Experience with HTML and CSS basics", "soft skill": "no"}
{"text": "Enthusiastic about writing clean code and implementing object-oriented design principles", "soft skill": "no"}
{"text": "Ability to implement automated testing platforms and unit tests", "soft skill": "no"}
{"text": "Experience with TDD or enthusiasm to learn this methodology", "soft skill": "no"}
{"text": "Desire to be a self-starter by taking the initiative to accomplish goals", "soft skill": "yes"}
{"text": "Comfortable with a team-based work structure; thrives in a flexible and fun atmosphere and can easily adapt to changing situations", "soft skill": "yes"}
{"text": "PHP Unit", "soft skill": "no"}
{"text": "Require.js", "soft skill": "no"}
{"text": "Knockout.js", "soft skill": "no"}
{"text": "jQuery", "soft skill": "no"}
{"text": "MySql", "soft skill": "no"}
{"text": "Agile Scrum Practices", "soft skill": "no"}
{"text": "Practical DevOps Experience Participating in Policies for Pull Requests, Builds and Releases", "soft skill": "no"}
{"text": "Git or similar source control", "soft skill": "no"}
{"text": "To qualify, applicants must be legally authorized to work in the United States and should not require now, or in the future, sponsorship for employment visa status.", "soft skill": "no"}
{"text": "EOE/AA: Minorities", "soft skill": "no"}
{"text": "/Females/Veterans/Disabled", "soft skill": "no"}
{"text": "Only applicants requiring reasonable accommodation for any part of the application and hiring process should contact us directly:", "soft skill": "no"}
{"text": "About you:", "soft skill": "no"}
{"text": "Talented front end engineer, passionate about performant and reliable web applications.", "soft skill": "no"}
{"text": "Architects stable and scalable code.", "soft skill": "no"}
{"text": "Finds the right balance between moving fast and minimizing code dept.", "soft skill": "no"}
{"text": "You love working on a team and developing new talent, but can execute independently, too.", "soft skill": "no"}
{"text": "Writing appropriate tests gives you a warm fuzzy feeling.", "soft skill": "no"}
{"text": "You know when to look for and implement the correct tool for the job, but can spin up custom code to solve programmatic challenges when nothing else will work .", "soft skill": "no"}
{"text": "You have good reasons for your choices and can explain them to junior developers.", "soft skill": "no"}
{"text": "You use process intelligently, in a way that benefits the team and software.", "soft skill": "yes"}
{"text": "Thoughtful, intelligent, and kind.", "soft skill": "yes"}
{"text": "Must have:", "soft skill": "no"}
{"text": "4 years experience building professional web applications", "soft skill": "no"}
{"text": "Excellent understanding of SPAs and modern front-end frameworks", "soft skill": "no"}
{"text": "; we use React", "soft skill": "no"}
{"text": "Proficient with web tools like NPM and Webpack", "soft skill": "no"}
{"text": "Excellent ES6 Javascript", "soft skill": "no"}
{"text": "Strong organization skills", "soft skill": "yes"}
{"text": "Good knowledge of the software development lifecycle", "soft skill": "no"}
{"text": "Design and implementation of best practices", "soft skill": "no"}
{"text": "Experience with JIRA or other project tracking software", "soft skill": "no"}
{"text": "Agile development", "soft skill": "no"}
{"text": "Strong communication skills and collaborative mindset.", "soft skill": "yes"}
{"text": "Collaborates seamlessly with other divisions outside software.", "soft skill": "yes"}
{"text": "Nice to have:", "soft skill": "no"}
{"text": "CSS preprocessors", "soft skill": "no"}
{"text": "RESTful APIs", "soft skill": "no"}
{"text": "Cloud environments, we use Azure", "soft skill": "no"}
{"text": "Experience working with QA engineers", "soft skill": "no"}
{"text": "We offer a competitive salary and benefits based on ability level including:", "soft skill": "no"}
{"text": "Unlimited vacation policy", "soft skill": "no"}
{"text": "Anniversary vacation bonus", "soft skill": "no"}
{"text": "FULLY paid health insurance premiums", "soft skill": "no"}
{"text": "Monthly transportation & phone stipend", "soft skill": "no"}
{"text": "Daily lunch & Monday morning bagels", "soft skill": "no"}
{"text": "In-office monthly massages, haircuts, & manicures", "soft skill": "no"}
{"text": "Dog friendly office", "soft skill": "no"}
{"text": "Agency Within is full of Rockstars", "soft skill": "no"}
{"text": "What do we actually do?", "soft skill": "no"}
{"text": "Some of our clients include Nike, Spanx, Blue Bottle Coffee, and more.", "soft skill": "no"}
{"text": "Infosys is seeking React Developer", "soft skill": "no"}
{"text": "You will also deliver high quality code deliverables for a module, lead validation for all types of testing and support activities related to implementation, transition and warranty.", "soft skill": "no"}
{"text": "You will be part of a learning culture, where teamwork and collaboration are encouraged, excellence is rewarded, and diversity is respected and valued.", "soft skill": "no"}
{"text": "Candidate must have located within commuting distance from Waltham,MA or be willing to relocate to the area.", "soft skill": "no"}
{"text": "U.S. citizens and those authorized to work in the U.S. are encouraged to apply.", "soft skill": "no"}
{"text": "Bachelor's degree or foreign equivalent required from an accredited institution.", "soft skill": "no"}
{"text": "Will also consider three years of progressive experience in the specialty in lieu of every year of education.", "soft skill": "no"}
{"text": "Preferred Skills & Experience:", "soft skill": "no"}
{"text": "At least 5 years of experience in the field of web development.", "soft skill": "no"}
{"text": "Ability to manage and deliver web sites with cutting edge UI and design within a short amount of time.", "soft skill": "no"}
{"text": "Expertise in designing and integrating multiple systems through robust security mechanisms.", "soft skill": "no"}
{"text": "Proficiency in HTML, CSS, JavaScript.", "soft skill": "no"}
{"text": "React Js", "soft skill": "no"}
{"text": "At least 3 years of experience in building Responsive Websites, across various devices.", "soft skill": "no"}
{"text": "Expert in CSS Methodologies - SMACSS, BEM, Atomic Design.", "soft skill": "no"}
{"text": "Expertise in CSS transpilers - SASS, POSTCSS.", "soft skill": "no"}
{"text": "Knowledge of UX best practices.", "soft skill": "no"}
{"text": "Knowledge of Agile principles, best practices, and tools.", "soft skill": "no"}
{"text": "Continuous improvement initiatives  Excellent communication and analytical skills  Ability to work in team in diverse/multiple stakeholder environment  Experience in Music Domain is a plus  Strong problem resolving skills  Ability to share and integrate knowledge across workgroups Excellent interpersonal skills", "soft skill": "yes"}
{"text": "Strong analytical and problem-solving skills", "soft skill": "yes"}
{"text": "The job entails sitting as well as working at a computer for extended periods of time.", "soft skill": "no"}
{"text": "Should be able to communicate by telephone, email or face to face.", "soft skill": "yes"}
{"text": "About Us", "soft skill": "no"}
{"text": "We enable clients in more than 50 countries to create and execute strategies for their digital transformation, staying a step ahead of emerging business trends and outperform the competition.", "soft skill": "no"}
{"text": "We help clients transform and thrive in a changing world by co-creating breakthrough solutions that combine strategic insights and execution excellence.", "soft skill": "no"}
{"text": "Our team of 200,000 innovators, across the globe, is differentiated by the imagination, knowledge and experience, that we bring to every project we undertake.", "soft skill": "no"}
{"text": "EOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/National Origin", "soft skill": "no"}
{"text": "Requirements:", "soft skill": "no"}
{"text": "Minimum of 3 years or more experience and knowledge with object-oriented PHP, Java script and jquery", "soft skill": "no"}
{"text": "Must have experience in LAMP environment development", "soft skill": "no"}
{"text": "Familiar with git", "soft skill": "no"}
{"text": "General understanding of MVC frameworks (knowing YII framework is a plus)", "soft skill": "no"}
{"text": "Helping to define and document project requirements and keep a timetable for accomplishing tasks", "soft skill": "no"}
{"text": "Work with our small team of developers to coordinate, execute and develop new features and prototypes for our unique search platform", "soft skill": "no"}
{"text": "Participate in all phases of development from definition and design through implementation, debugging, testing and deployment using best practices", "soft skill": "no"}
{"text": "Excellent verbal communication skills", "soft skill": "yes"}
{"text": "A start-up mentality and work ethic (excellent time management, great quality work, understanding of deadlines, etc.)", "soft skill": "yes"}
{"text": "Overview", "soft skill": "no"}
{"text": "JS + Security Clearance Required):", "soft skill": "no"}
{"text": "Selected applicants will be subject to a government investigation and must meet eligibility requirements and obtain Government-granted access.", "soft skill": "no"}
{"text": "This postion is located in  Chantilly, VA .", "soft skill": "no"}
{"text": "Applied Memetics LLC (AM LLC) is seeking a  Front-end Developer (Angular.", "soft skill": "no"}
{"text": "JS + Security Clearance Required)  to provide on-site technical support to a Department of Defense (\"DoD\")", "soft skill": "no"}
{"text": "Military Health program.", "soft skill": "no"}
{"text": "The program supports", "soft skill": "no"}
{"text": "These services encompass customer and call center support activities, as well as referrals/authorizations and claims adjudications, among other areas, related to DoD heath care throughout the United States.", "soft skill": "no"}
{"text": "Specifically, the program would provide health care support services that integrate private-sector care within the DoD direct-care system, serving approximately 9.2 million active duty personnel, active duty family members, retired military members and their families, and survivor beneficiaries.", "soft skill": "no"}
{"text": "Responsibilities", "soft skill": "no"}
{"text": "Responsiblities of the Front-end Developer (Angular.", "soft skill": "no"}
{"text": "JS + Security Clearance Required):", "soft skill": "no"}
{"text": "Significant experience developing web-based applications in production environments specific to Angular.", "soft skill": "no"}
{"text": "JS", "soft skill": "no"}
{"text": "Strrong experience with Angular.", "soft skill": "no"}
{"text": "JS", "soft skill": "no"}
{"text": "Experiecne implementing web applications using JavaScript", "soft skill": "no"}
{"text": "Experience with responsive layout and design, preferably with Bootstrap framework", "soft skill": "no"}
{"text": "Familiarity with continuous integration", "soft skill": "no"}
{"text": "Clear communicator, both written and oral, and able to work with marketing teams effectively", "soft skill": "yes"}
{"text": "Qualifications", "soft skill": "no"}
{"text": "Basic Qualifications of the Front-end Developer (Angular.", "soft skill": "no"}
{"text": "JS + Security Clearance Required):", "soft skill": "no"}
{"text": "2-4 years of front-end development experience with JavaScript", "soft skill": "no"}
{"text": "JS experience", "soft skill": "no"}
{"text": "AngularJS experience is mandatory", "soft skill": "no"}
{"text": "JavaScript experience is manadatory", "soft skill": "no"}
{"text": "Must be a US Citizen and have the ability to obtain a clearance", "soft skill": "no"}
{"text": "Preferred Qualifications of the Front-end Developer (Angular.", "soft skill": "no"}
{"text": "Must be technical, creative, detail-oriented, and a strong team player", "soft skill": "yes"}
{"text": "Strong written and communication skills", "soft skill": "yes"}
{"text": "The position will report to the technical lead, but will frequently engage with other members of the development/QA staff, as well as with product and UX teams, to help scope, design, and estimate features and enhancements being considered for prioritization.", "soft skill": "no"}
{"text": "Responsibilities", "soft skill": "no"}
{"text": "Develop new features and user experiences in our next generation web and desktop applications, working closely with QA to ensure a quality end user experience.", "soft skill": "no"}
{"text": "Coordinate with product and UX teams to help scope, design, and estimate features and enhancements being considered.", "soft skill": "no"}
{"text": "Ensure clean coding practices and patterns are used through collaborative code design and review.", "soft skill": "no"}
{"text": "Monitor crash reporting and performance/analytics services to identify trends or spikes of importance or concern.", "soft skill": "no"}
{"text": "Qualifications", "soft skill": "no"}
{"text": "3+ years of development experience on JavaScript applications using any modern framework (React, Angular, Backbone, etc.)", "soft skill": "no"}
{"text": "with emphasis on the latest ECMAScript standards.", "soft skill": "no"}
{"text": "1+ year of experience with React in a production setting (experience with Redux and/or Electron is a plus).", "soft skill": "no"}
{"text": "Write unit / snapshot tests using Jest.", "soft skill": "no"}
{"text": "Experience with Sass, and Less preprocessors", "soft skill": "no"}
{"text": "(CSS Modules is a plus).", "soft skill": "no"}
{"text": "Ability to debug API responses.", "soft skill": "no"}
{"text": "Experience with Node.js and maintaining npm packages.", "soft skill": "no"}
{"text": "Knowledge of the latest HTML and CSS standards and patterns.", "soft skill": "no"}
{"text": "Familiarity with development/build tools such as Webpack, Babel, Lerna, etc.", "soft skill": "no"}
{"text": "Ability to work well in a distributed team.", "soft skill": "yes"}
{"text": "Strong writing and communications skills.", "soft skill": "yes"}
{"text": "Proactive mindset with a passion for making things better.", "soft skill": "yes"}
{"text": "Willingness to learn new technologies.", "soft skill": "yes"}
{"text": "Neat is a company with a rich history in innovation.", "soft skill": "no"}
{"text": "Headquartered in Philadelphia, PA, Neat began as an expense tracking software app for individuals and small business and later expanded to include personal scanners for document organization and management.", "soft skill": "no"}
{"text": "Neat grew to be one of the top providers of integrated scanner/organizational software in the US.", "soft skill": "no"}
{"text": "Neat has recently began the process of divesting its hardware side of the business to allow it to focus solely on SaaS software.", "soft skill": "no"}
{"text": "We behave like a startup culture, with strong financial backing and seasoned leadership and investment partners.", "soft skill": "no"}
{"text": "We commit to providing an environment where you can grow, lead and develop your skills with a market leader...", "soft skill": "no"}
{"text": "and we like to have fun with great perks and frequent company outings and events.", "soft skill": "no"}
{"text": "careers@neat.com", "soft skill": "no"}
{"text": "with the job title in the subject line.", "soft skill": "no"}
{"text": "Description", "soft skill": "no"}
{"text": "Prudential Workplace Solutions Group (WSG)", "soft skill": "no"}
{"text": "technology team is looking to hire a hands-on developer to advance our architectural strategies and innovation efforts.", "soft skill": "no"}
{"text": "Ideal candidate is someone who is tech-savvy, passionate to learn and adopt new technologies, understands web development technology stack, emerging web standards and able to turn concepts to life.", "soft skill": "no"}
{"text": "The selected individual will be part of talented engineering team working in a fast-paced and outcome focused environment.", "soft skill": "no"}
{"text": "Responsibilities:", "soft skill": "no"}
{"text": "Development of cloud native applications and services", "soft skill": "no"}
{"text": "Development of micro-frontends and standalone web components", "soft skill": "no"}
{"text": "Deliver high-quality testable code with attention to details", "soft skill": "no"}
{"text": "Identify, analyze, debug and tune application performance", "soft skill": "no"}
{"text": "Conduct code reviews for system modifications and development", "soft skill": "no"}
{"text": "Decoupling existing features from monolithic platform to micro-services", "soft skill": "no"}
{"text": "Qualifications", "soft skill": "no"}
{"text": "Associate / bachelor's degree or higher in Computer Science, Computer Engineering, Applied Mathematics with a GPA >= 3.3", "soft skill": "no"}
{"text": "Strong object-oriented, functional and procedural design skills coupled with a deep knowledge of data structures and algorithms", "soft skill": "no"}
{"text": "Excellent analytical, problem-solving, debugging and critical thinking skills", "soft skill": "no"}
{"text": "Working knowledge of Linux / Unix is preferred", "soft skill": "no"}
{"text": "Experience with web frameworks and W3C standards is a plus", "soft skill": "no"}
{"text": "Demonstrable experience in application development is a plus", "soft skill": "no"}
{"text": "Able to craft multi-functional requirements and translate them into practical engineering tasks", "soft skill": "no"}
{"text": "Ability to work in a fast paced, team-based environment", "soft skill": "yes"}
{"text": "Strong verbal and written communication skills and social skills", "soft skill": "yes"}
{"text": "Prudential is a multinational financial services leader with operations in the United States, Asia, Europe, and Latin America.", "soft skill": "no"}
{"text": "The company's well-known Rock symbol is an icon of strength, stability, expertise and innovation that has stood the test of time.", "soft skill": "no"}
{"text": "Prudential's businesses offer a variety of products and services, including life insurance, annuities, retirement-related services, mutual funds, asset management, and real estate services.", "soft skill": "no"}
{"text": "We recognize that our strength and success are directly linked to the quality and skills of our diverse associates.", "soft skill": "no"}
{"text": "We are proud to be a place where talented people who want to make a difference can grow as professionals, leaders, and as individuals.", "soft skill": "no"}
{"text": "Visit www.prudential.com to learn more about our values, our history and our brand.", "soft skill": "no"}
{"text": "Prudential is an equal opportunity employer.", "soft skill": "no"}
{"text": "Search firms or agencies should email Staffing at staffingagencies@prudential.com for more information about doing business with Prudential.", "soft skill": "no"}
{"text": "Job Function Software/System Development", "soft skill": "no"}
{"text": "Primary Location United States-Connecticut-Hartford", "soft skill": "no"}
{"text": "Other Locations United States-New Jersey-Roseland", "soft skill": "no"}
{"text": "Schedule Full-time", "soft skill": "no"}
{"text": "Travel No", "soft skill": "no"}
{"text": "The Web Developer is responsible for the design, implementation and/or installation of designated web software, forms and other web projects, as well as support operations for the web infrastructure.", "soft skill": "no"}
{"text": "Routine Duties and Responsibilities:", "soft skill": "no"}
{"text": "Web form management", "soft skill": "no"}
{"text": "Third-party software installation and management", "soft skill": "no"}
{"text": "In-house software creation and management", "soft skill": "no"}
{"text": "Misc. web projects as needed", "soft skill": "no"}
{"text": "Minimum Education : Bachelor's degree in Computer Science or equivalent education/experience", "soft skill": "no"}
{"text": "Required Skills", "soft skill": "no"}
{"text": "Strong proficiency with the construction of custom user-centric web applications using PHP and MySQL.", "soft skill": "no"}
{"text": "These applications need to utilize current web standards and best practices", "soft skill": "no"}
{"text": "Strong proficiency in LAMP and/or WAMP development and interrelated technologies", "soft skill": "no"}
{"text": "An ability to set up, administer and modify third-party server side software", "soft skill": "no"}
{"text": "An ability to convert graphic layouts and content from Adobe Photoshop and/or Illustrator into fully functional websites with pixel perfect accuracy", "soft skill": "no"}
{"text": "An eye for detail, strong grasp of web standards, usability standards, technology trends, SEO/SEM principles, device portability and browser compatibility", "soft skill": "no"}
{"text": "Must work well within a multidisciplinary team, capable of processing multiple projects simultaneously, rapidly - sometimes on a moment's notice", "soft skill": "yes"}
{"text": "Can assist the institution and its various departments as a subject matter expert, trainer, and troubleshooter for all things related to the web", "soft skill": "no"}
{"text": "Be able to give valued insight and perspective in the form of project scope documentation and timing for tasks", "soft skill": "no"}
{"text": "Must be able to work outside the normal working schedule when needed", "soft skill": "yes"}
{"text": "Required Experience", "soft skill": "no"}
{"text": "Bachelor's degree in Computer Science or equivalent education/experience", "soft skill": "no"}
{"text": "Minimum 1-3 years of web development including database management and ecommerce", "soft skill": "no"}
{"text": "Are you passionate about staying ahead of the curve on front end technology and development trends in the industry?", "soft skill": "no"}
{"text": "Do you have the ability to think outside of the box and come up with fresh and new solutions to help deliver highly impactful learning solutions?", "soft skill": "no"}
{"text": "If so, we are looking for a Full-Stack Developer who is an authority in creating and building user interfaces.", "soft skill": "no"}
{"text": "You have a minimum of 5+ years of industry experience coding in HTML, JavaScript, and CSS/CSS3 with a BS in", "soft skill": "no"}
{"text": "Computer Science OR", "soft skill": "no"}
{"text": "8-10 years of equivalent industry experience with a validated track record.", "soft skill": "no"}
{"text": "Your deep understanding of JS MVC frameworks (AngularJS, Bootstrap, React) is needed", "soft skill": "no"}
{"text": "Required experience in the following:", "soft skill": "no"}
{"text": "MySQL databases, AJAX/REST, JSON, JS Libraries", "soft skill": "no"}
{"text": "Experience using other dynamic web application languages (Python)", "soft skill": "no"}
{"text": "Possess knowledge and understanding of UX Design principles", "soft skill": "no"}
{"text": "Knowledge of integrating web accessibility standards is a nice to have", "soft skill": "no"}
{"text": "In depth knowledge of cross-browser, cross-platform & cross-device compatibility standards and behaviors", "soft skill": "no"}
{"text": "Superb communication, leadership and presentation skills", "soft skill": "yes"}
{"text": "Keen eye for detail and experience collaborating with design teams to deliver extraordinary web experiences", "soft skill": "yes"}
{"text": "High ownership, self-sufficient, hands-on leader to drive quality and maintain application stability (debugging, etc.)", "soft skill": "yes"}
{"text": "Ability to brainstorm and communicate technology ideas and issues with peers and IT management", "soft skill": "yes"}
{"text": "a plus", "soft skill": "no"}
{"text": "In this role, your responsibilities will include the following:", "soft skill": "no"}
{"text": "Develop and implement solutions that are fully integrated with Information Technology standards and demonstrate standard methodologies Lead the technical aspect of the front and back end delivery for multiple projects, setting technical direction, while delivering quality results Build and maintain positive relationships with extended functional teams Investigate, evangelize, and implement the latest web technologies across the learning organization", "soft skill": "no"}
{"text": ", we believe that software has the power to unlock new opportunities for people and our planet.", "soft skill": "no"}
{"text": "We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly.", "soft skill": "no"}
{"text": "At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community.", "soft skill": "no"}
{"text": "Equal Employment Opportunity Statement:", "soft skill": "no"}
{"text": "VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment.", "soft skill": "no"}
{"text": "VMware will not tolerate discrimination or harassment based on any of these characteristics.", "soft skill": "no"}
{"text": "Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.", "soft skill": "no"}
{"text": "Our core competencies include custom web design and development, eCommerce stores, branding, and all things digital marketing.", "soft skill": "no"}
{"text": "We take a unique, audience-based approach to our work, allowing us to successfully drive results across a wide variety of both B2C and B2B industries.", "soft skill": "no"}
{"text": "The VividFront team prides itself on the ability to constantly adapt and creatively solve problems in the ever-changing world of digital marketing.", "soft skill": "no"}
{"text": "Departments work side-by-side in a highly collaborative, creative and energizing environment.", "soft skill": "no"}
{"text": "Our development work spans many platforms, but 95% of what we do is done in the LAMP stack.", "soft skill": "no"}
{"text": "We build upon frameworks like Magento, WordPress, Laravel, Symfony, and Zend.", "soft skill": "no"}
{"text": "Job Description", "soft skill": "no"}
{"text": "You will work with other developers and designers to bridge the gap between design and development implementation, taking an active role on both sides by defining how the application works, looks and performs.", "soft skill": "no"}
{"text": "Develop new user-facing features", "soft skill": "no"}
{"text": "Build reusable code and libraries for future use", "soft skill": "no"}
{"text": "Ensure the technical feasibility of UI/UX designs", "soft skill": "no"}
{"text": "Provide input on designs and best practices", "soft skill": "no"}
{"text": "Optimize code for maximum speed and scalability", "soft skill": "no"}
{"text": "Collaborate with other team members", "soft skill": "no"}
{"text": "Required Skills and Experience", "soft skill": "no"}
{"text": "Proficient understanding of web markup, including HTML5 and CSS3", "soft skill": "no"}
{"text": "Proficient understanding of client-side scripting and JavaScript frameworks", "soft skill": "no"}
{"text": "Basic familiarity with tools such as Gimp or Photoshop", "soft skill": "no"}
{"text": "Good understanding of cross-browser compatibility issues and ways to work around them", "soft skill": "no"}
{"text": "Ability to understand CSS changes and their ramifications to ensure consistent style across platforms and browsers", "soft skill": "no"}
{"text": "Proficient understanding of code versioning tools, such as Git", "soft skill": "no"}
{"text": "Basic understanding of SEO principles and ensuring code adheres to them", "soft skill": "no"}
{"text": "3+ years of front end development", "soft skill": "no"}
{"text": "Good to have Skills and Experience", "soft skill": "no"}
{"text": "Basic understanding of Vue,js, KnockoutJS, and ReactJS", "soft skill": "no"}
{"text": "Experience in the LAMP stack with platforms such as WordPress, Magento, and Laravel", "soft skill": "no"}
{"text": "Basic understanding of Twig", "soft skill": "no"}
{"text": "Why Choose VividFront?", "soft skill": "no"}
{"text": "\"Unlimited\" paid vacation policy", "soft skill": "no"}
{"text": "Free Healthcare, dental, and vision benefits with your premiums 100% paid by us, nothing out of your paycheck", "soft skill": "no"}
{"text": "Limitless opportunities for growth and advancement", "soft skill": "no"}
{"text": "LunchOwl", "soft skill": "no"}
{"text": "Free, unlimited snacks and beverages", "soft skill": "no"}
{"text": "Company Happy Hours", "soft skill": "no"}
{"text": "Continuing Education Opportunities", "soft skill": "no"}
{"text": "A downtown Cleveland office with natural light and an amazing location near restaurants, coffee shops, Progressive Field and Rocket Mortgage FieldHouse", "soft skill": "no"}
{"text": "Free downtown parking", "soft skill": "no"}
{"text": "2019 Northcoast 99 Top Workplaces for Top Talent Winner", "soft skill": "no"}
{"text": "Ready to apply?", "soft skill": "no"}
{"text": "Use the form below.", "soft skill": "no"}
{"text": "This position is based in Winchester, VA as part of a dynamic agile team located on site supporting the Federal Emergency Management Agency (FEMA).", "soft skill": "no"}
{"text": "The candidate must demonstrate the ability to work directly with our clients and development team to provide quality web application development support utilizing the agile methodology.", "soft skill": "no"}
{"text": "Responsibilities will include creating and maintaining web-based applications using .NET, C# and Java Script technologies.", "soft skill": "no"}
{"text": "Proven and demonstrable communication (written, verbal and presentation) skills are mandatory.", "soft skill": "yes"}
{"text": "US Citizenship is required.", "soft skill": "no"}
{"text": "Up to three days of telework per week available", "soft skill": "no"}
{"text": "Location, Salary and Benefits:", "soft skill": "no"}
{"text": "Winchester, VA", "soft skill": "no"}
{"text": "Benefits - Health care, 401k, and paid time off", "soft skill": "no"}
{"text": "5 to 7 years' experience of web application development experience", "soft skill": "no"}
{"text": "At minimum, hold a bachelor's degree from an accredited university", "soft skill": "no"}
{"text": "In the event of further consideration by our firm, you must be prepared to undergo and pass:", "soft skill": "no"}
{"text": "A full background and favorable security clearance check by the U.S. Office of Personnel Management (OPM), DHS and FEMA", "soft skill": "no"}
{"text": "A background screening performed by our firm, contractor or authorized agent", "soft skill": "no"}
{"text": "Skills and Experience:", "soft skill": "no"}
{"text": "Between 5 to 7 years of relevant experience", "soft skill": "no"}
{"text": "Demonstrably solid written and verbal communication skills to drive projects to successful conclusion; strong analytical and troubleshooting skills", "soft skill": "yes"}
{"text": "Flexible, self-directed and motivated individual, able to accommodate to shifting priorities with minimum oversight and acquire new skills autonomously", "soft skill": "yes"}
{"text": "Experience working within an Agile environment and an understanding of basic Agile concepts", "soft skill": "no"}
{"text": "Possess an understanding complex functions in applications", "soft skill": "no"}
{"text": "Skilled in creating and maintaining web-based applications from business requirements using .NET, C# and Java Script technologies", "soft skill": "no"}
{"text": "Creating and designing web based applications that interact with Oracle RDBMS", "soft skill": "no"}
{"text": "Proficient in writing server side code and client-side procedural code, troubleshooting problems, debugging code used in database and web interfaces utilizing Visual Studio IDE, and creating and maintaining database queries", "soft skill": "no"}
{"text": "Experience with creating and modifying deployment build plans, conducting scans for security vulnerabilities, writing remediation plans, and providing reasoned justifications for false positives", "soft skill": "no"}
{"text": "In this position you will be tasked to:", "soft skill": "no"}
{"text": "Collaborate and communicate with our team, clients and stakeholders to produce deliverables on a timely basis", "soft skill": "no"}
{"text": "Manage your tasks and associated activities for federal clients and manage client expectations", "soft skill": "no"}
{"text": "Take direction from and communicate effectively with our firm's Program Manager", "soft skill": "no"}
{"text": "Develop professional relationships with our team, clients and stakeholders", "soft skill": "no"}
{"text": "Understand and be able to communicate the client mission, business and operational situation", "soft skill": "yes"}
{"text": "Work with and collaborate with the team's Program Manager, team members and teaming partners", "soft skill": "no"}
{"text": "An ideal applicant will:", "soft skill": "no"}
{"text": "Be able to manage, prioritize and work multiple projects and tasks at the same time", "soft skill": "yes"}
{"text": "Be enthusiastic, professional, energetic, detailed orientated, well-organized, and possess an excellent business acumen", "soft skill": "yes"}
{"text": "Be expected to maintain the highest standards of ethical and professional behavior in business and in public", "soft skill": "yes"}
{"text": "Be able to articulate our firm's core competencies, the client's mission and the task objective", "soft skill": "yes"}
{"text": "Be familiar with IT operations and have a basic understanding of Cloud and Database structures", "soft skill": "no"}
{"text": "Have experience with Jira", "soft skill": "no"}
{"text": "Job Description", "soft skill": "no"}
{"text": "We are looking for a strong PHP developer to join our development team.", "soft skill": "no"}
{"text": "You will be involved in a variety of exciting and challenging projects.", "soft skill": "no"}
{"text": "We have several websites and backend micro services you will be enhancing and optimizing, as well as writing new sites and services.", "soft skill": "no"}
{"text": "We are a small development team that allows you a lot of autonomy in how you work and develop.", "soft skill": "no"}
{"text": "Qualifications", "soft skill": "no"}
{"text": "Position Requirements:", "soft skill": "no"}
{"text": "You are an experienced OOP PHP developer", "soft skill": "no"}
{"text": "You are experienced in testing and validating code", "soft skill": "no"}
{"text": "You are flexible to learn and use other technologies as needed", "soft skill": "no"}
{"text": "Strong Preference:", "soft skill": "no"}
{"text": "Experienced using the Laravel Framework", "soft skill": "no"}
{"text": "Above average SQL skills", "soft skill": "no"}
{"text": "Experienced with Git & Github", "soft skill": "no"}
{"text": "Classic ASP (we still have one site in this older language)", "soft skill": "no"}
{"text": "Experienced with Javascript (jQuery and/or ViewJs)", "soft skill": "no"}
{"text": "Additional Information", "soft skill": "no"}
{"text": "At REI, our goal is to maintain a stress-free but highly productive and collaborative environment.", "soft skill": "no"}
{"text": "Our team members love what they do and work very well together.", "soft skill": "no"}
{"text": "We are an Agile team using the Scrum methodology.", "soft skill": "no"}
{"text": "Our office is conveniently located in the historical Tribeca Lofts building in Montrose and offers a relaxed atmosphere that is convenient and conducive to work.", "soft skill": "no"}
{"text": "We Offer:", "soft skill": "no"}
{"text": "Competitive pay", "soft skill": "no"}
{"text": "Company-paid health benefits", "soft skill": "no"}
{"text": "Retirement plan with company matching", "soft skill": "no"}
{"text": "A relaxed office with free snacks and beverages", "soft skill": "no"}
{"text": "A fulfilling, dynamic environment", "soft skill": "no"}
{"text": "Opportunities for professional development and career growth", "soft skill": "no"}
{"text": "The opportunity to help our customers achieve their dreams and improve their lives", "soft skill": "no"}
{"text": "How to Apply:", "soft skill": "no"}
{"text": "If we described you to a T, we'd love to hear from you!", "soft skill": "no"}
{"text": "\"I'm Interested\" button to complete your application.", "soft skill": "no"}
{"text": "When applying, please include:", "soft skill": "no"}
{"text": "Resume in PDF format", "soft skill": "no"}
{"text": "Cover Letter", "soft skill": "no"}
{"text": "To be considered for this role,  please apply by 12/31/2019 .", "soft skill": "no"}
{"text": "For more information about us and what we do, visit www.reinetworklp.com.", "soft skill": "no"}
{"text": "Briteskies is hiring", "soft skill": "no"}
{"text": "Are you passionate about creating an amazing customer experience?", "soft skill": "no"}
{"text": "Responsibilities include:", "soft skill": "no"}
{"text": "Researching, installing, and configuring Magento extensions", "soft skill": "no"}
{"text": "Extending Magento functionality through custom programming", "soft skill": "no"}
{"text": "Candidate should have:", "soft skill": "no"}
{"text": "Expertise in HTML, CSS/LESS, Javascript, PHP, JSON, XML", "soft skill": "no"}
{"text": "Knowledge i Javascript - jQuery, Knockout, RequireJS", "soft skill": "no"}
{"text": "Experience with A/B testing and other customer segmentation optimizations", "soft skill": "no"}
{"text": "Experience with software development lifecycle especially dev testing and QA resolution processing", "soft skill": "no"}
{"text": "A creative problem solver, self-motivated and tenacious mindset when tackling tough issues", "soft skill": "yes"}
{"text": "The ability to be a team player with energy and enthusiasm, and an ability to manage multiple projects", "soft skill": "yes"}
{"text": "3+ years front end development in a collaborative team environment", "soft skill": "no"}
{"text": "Principal Engineer", "soft skill": "no"}
{"text": "Qualification:", "soft skill": "no"}
{"text": "Science / Engineering graduate", "soft skill": "no"}
{"text": "Responsibility:", "soft skill": "no"}
{"text": "Participate in requirement gathering JAD sessions and support documentation where applicable (business, functional, UI, usability, data, compliance, data migration, NFR, 3rd party tools & products).", "soft skill": "no"}
{"text": "understand and translate requirements into design.", "soft skill": "no"}
{"text": "Thought Leadership / Process Improvements / Delivery Excellence:", "soft skill": "no"}
{"text": "* ' Lead technology inititives, incubate and build tools & reusable assets for dev / Productivity enhancement.", "soft skill": "no"}
{"text": "Create reusable assets / supporting artifacts based on the industry landscape.", "soft skill": "no"}
{"text": "Identify reusable solutions/assets which can be built within the technology unit.", "soft skill": "no"}
{"text": "Coauthor points of view.", "soft skill": "no"}
{"text": "publish whitepapers.", "soft skill": "no"}
{"text": "represent in the Technology Conferences/Roadshows/Forums.", "soft skill": "no"}
{"text": "/whitepapers on application/solution/enterprise architecture / technology recommendations.", "soft skill": "no"}
{"text": "Participate and present in industry forums, technology forums and workshops.", "soft skill": "no"}
{"text": "Project Estimation:", "soft skill": "no"}
{"text": "* ' Provide input on technical effort estimation to arrive at resourcing plans.", "soft skill": "no"}
{"text": "participate in management reviews and teleconferences and report weekly status and walkthrough to the Project Manager / Client.", "soft skill": "no"}
{"text": "Followup with customer POC to resolve team issues and dependencies.", "soft skill": "no"}
{"text": "raise concerns regarding changes in timelines and expectations with customer point of contact to resolve the same.", "soft skill": "no"}
{"text": "Technology Review for Projects:", "soft skill": "no"}
{"text": "* Review deliverables, and tasks Assigned to the team to ensure quality deliverables ontime.", "soft skill": "no"}
{"text": "Capability Development:", "soft skill": "no"}
{"text": "* ' Build technical skills and capabilities through training and mentoring,.", "soft skill": "no"}
{"text": "Train the teams on technology tools and techniques.", "soft skill": "no"}
{"text": "Enable Knowledge sharing and training for the developers.", "soft skill": "no"}
{"text": "Develop proof of concept as designed by architect.", "soft skill": "no"}
{"text": "Understand interdependencies of the various components in work packages that are being developed.", "soft skill": "no"}
{"text": "Work with architect to understand the architecture of the application, high level approaches and ensure that the design is in line with overall direction.", "soft skill": "no"}
{"text": "conduct peer review, as required.", "soft skill": "no"}
{"text": "Organize design review sessions with various stakeholders to validate design is as per requirements.", "soft skill": "no"}
{"text": "Identify the standards applicable for the work packages / components.", "soft skill": "no"}
{"text": "Review the code created by team and provide review comments to the developers.", "soft skill": "no"}
{"text": "develop code for core / critical module(s) needed for the project.", "soft skill": "no"}
{"text": "Contribute towards development of framework.", "soft skill": "no"}
{"text": "Develop/ review tier coding, business layer coding, interface development, service development, creation of stored procedures etc as applicable for the work package / project.", "soft skill": "no"}
{"text": "Write efficient queries and understand logical and physical data models.", "soft skill": "no"}
{"text": "follow up with Developers to ensure integration of components (input / output).", "soft skill": "no"}
{"text": "troubleshoot critical technical issues.", "soft skill": "no"}
{"text": "Handle escalations related to critical technical issues.", "soft skill": "no"}
{"text": "track the status of the tasks assigned, maintain detailed task information for the work packages owned and do periodic reporting.", "soft skill": "no"}
{"text": "conduct technical review and audit.", "soft skill": "no"}
{"text": "Create quality check points for all deliverables.", "soft skill": "no"}
{"text": "estimate at task level in the area of work concerned, measure and report the actual effort against the estimated effort and ensure task progress reporting in C20 or any other applicable tool.", "soft skill": "no"}
{"text": "Prepare and report status for the scope responsible.", "soft skill": "no"}
{"text": "conduct peer reviews in coding and testing phase.", "soft skill": "no"}
{"text": "Testing:  * ' Develop comprehensive unit testing cases for modules developed (as required) and unit test plans.", "soft skill": "no"}
{"text": "execute unit testing.", "soft skill": "no"}
{"text": "Create unit test logs.", "soft skill": "no"}
{"text": "Perform developer integration testing by integrating the components developed by each individual team member and ensure that the integration for the teams work has been completed before the next phase of testing (system testing).", "soft skill": "no"}
{"text": "Signoff on test cases created by team.", "soft skill": "no"}
{"text": "discuss results / actions from NFR testing and signoff on the same for system testing / NFR.", "soft skill": "no"}
{"text": "* Participate in defect triage meetings with the team and confirm the defects identified, highlight any new change request to the agreed scope and identify actions to reduce defects.", "soft skill": "no"}
{"text": "identify ways to prevent defects.", "soft skill": "no"}
{"text": "Participate in transition of knowledge and to support organization with any defects raised post production as required.", "soft skill": "no"}
{"text": "* Create training plan for team as identified in the training plan for the project.", "soft skill": "no"}
{"text": "Plan and participate in innovation sessions.", "soft skill": "no"}
{"text": "identify and implement innovative processes to reduce manual intervention and improve productivity based on technology and domain expertise.", "soft skill": "no"}
{"text": "Prepare business case to quantify process improvement (efforts saved etc).", "soft skill": "no"}
{"text": "Participate in front end delivery audit(s).", "soft skill": "no"}
{"text": "highlight and identify technical risks to project manager.", "soft skill": "no"}
{"text": "Knowledge Management:", "soft skill": "no"}
{"text": "* ' Contribute towards updating knowledge assets, user manual, online help document, installation scripts and installation manual and leverage the same.", "soft skill": "no"}
{"text": "Support process audit activities.", "soft skill": "no"}
{"text": "Conduct knowledge transfer sessions for new joiners in the project team.", "soft skill": "no"}
{"text": "conduct training through academy (if approved).", "soft skill": "no"}
{"text": "Guide and mentor team junior members from a technical perspective to ensure quality delivery of the components.", "soft skill": "no"}
{"text": "People management:  *", "soft skill": "no"}
{"text": "' Engage with team.", "soft skill": "no"}
{"text": "set stretch targets and track performance against the same periodically.", "soft skill": "no"}
{"text": "Identify, groom, reward and develop high performers.", "soft skill": "no"}
{"text": "create training plans for team.", "soft skill": "no"}
{"text": "Technical Skills SNo", "soft skill": "no"}
{"text": "Primary Skill Proficiency Level *", "soft skill": "no"}
{"text": "Rqrd./Dsrd. 1", "soft skill": "no"}
{"text": "Angular JS PL3 Required 2 HTML 5 PL4", "soft skill": "no"}
{"text": "Desired 3 JQuery PL4", "soft skill": "no"}
{"text": "Required 4 JavaScript PL3", "soft skill": "no"}
{"text": "Required 5 CSS PL4", "soft skill": "no"}
{"text": "Required 6 HTML PL3 Required", "soft skill": "no"}
{"text": "Proficiency Legends Proficiency Level", "soft skill": "no"}
{"text": "Generic Reference PL1", "soft skill": "no"}
{"text": "The associate has basic awareness and comprehension of the skill and is in the process of acquiring this skill through various channels.", "soft skill": "no"}
{"text": "PL2", "soft skill": "no"}
{"text": "The associate possesses working knowledge of the skill, and can actively and independently apply this skill in engagements and projects.", "soft skill": "no"}
{"text": "PL3", "soft skill": "no"}
{"text": "The associate has comprehensive, in-depth and specialized knowledge of the skill.", "soft skill": "no"}
{"text": "he has extensively demonstrated successful application of the skill in engagements or projects.", "soft skill": "no"}
{"text": "PL4 The associate can function as a subject matter expert for this skill.", "soft skill": "no"}
{"text": "Employee Status :  Full Time Employee", "soft skill": "no"}
{"text": "Shift :  Day Job", "soft skill": "no"}
{"text": "Travel :  No", "soft skill": "no"}
{"text": "Job Posting :", "soft skill": "no"}
{"text": "Nov 18 2019", "soft skill": "no"}
{"text": "About Cognizant Cognizant (Nasdaq-100:  CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era.", "soft skill": "no"}
{"text": "Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses.", "soft skill": "no"}
{"text": "Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world.", "soft skill": "no"}
{"text": "Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @Cognizant.", "soft skill": "no"}
{"text": "Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission.", "soft skill": "no"}
{"text": "Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service.", "soft skill": "no"}
{"text": "Front End Developer", "soft skill": "no"}
{"text": "When you join Dynamo, you don't just become another number, you become part of a family.", "soft skill": "no"}
{"text": "A family who thrives to keep morale high and opportunities endless.", "soft skill": "no"}
{"text": "We believe in hiring strong team players who are passionate and driven to succeed.", "soft skill": "no"}
{"text": "Our mission is your professional development.", "soft skill": "no"}
{"text": "Job Description:", "soft skill": "no"}
{"text": "Work with a dynamic development on building beautiful and responsive applications in React / HTML5 / CSS3.", "soft skill": "no"}
{"text": "Create responsive, mobile-ready pages as well as rich and dynamic content.", "soft skill": "no"}
{"text": "Write functional requirement documents and specifications.", "soft skill": "no"}
{"text": "Provide enhancements and maintenance of websites/portals.", "soft skill": "no"}
{"text": "Assist back-end developers with coding and troubleshooting.", "soft skill": "no"}
{"text": "Maintain graphic standards and branding throughout the product's interface.", "soft skill": "no"}
{"text": "Remain up-to-date on emerging technologies.", "soft skill": "no"}
{"text": "Promote usability best practices.", "soft skill": "no"}
{"text": "Required   Qualifications", "soft skill": "no"}
{"text": "Required Skillset: 2 - 5 years of relevant experience with advanced JavaScript libraries and frameworks Proficiency in React, Angular, or Vue (React-preferred) Comfortable with HTML5, CSS3 (SASS), and modern UI frameworks (Bootstrap, Material, etc.)", "soft skill": "no"}
{"text": "Strong understanding of object-oriented data models Ability to communicate effectively with technical and non-technical audiences Possession of excellent analytical skills", "soft skill": "no"}
{"text": "What We Offer You:", "soft skill": "no"}
{"text": "An engaging, familial culture centered around personal and team development  100% paid medical benefits", "soft skill": "no"}
{"text": "401K with company match", "soft skill": "no"}
{"text": "Tuition reimbursements  Monthly commuting stipends", "soft skill": "no"}
{"text": "Clearance: None", "soft skill": "no"}
{"text": "Primary Location: Mclean, VA", "soft skill": "no"}
{"text": "Dynamo has extensive experience successfully servicing numerous US federal agencies and commercial customers.", "soft skill": "no"}
{"text": "Our experienced leadership team combined with the quality and caliber of our data scientists, software engineers, technologists and program management professionals sets us apart from the competition.", "soft skill": "no"}
{"text": "With over twenty-five different websites and each with a unique focus of product offerings and services, we have been successful in positioning ourselves at the top of all search results.", "soft skill": "no"}
{"text": "Our online store, America's Fence Store, has a fast-growing e-commerce platform in Shopify, making us one of the largest resellers of fence materials online.", "soft skill": "no"}
{"text": "As much as we recognize our success; we also recognize our need to continue to develop these sites.", "soft skill": "no"}
{"text": "We have a considerable appetite for improvements, re-design and new sites.", "soft skill": "no"}
{"text": "The Web Developer is a target specific position working in cooperation with our marketing team and company leadership.", "soft skill": "no"}
{"text": "This new position will be responsible for the design, creation, and modification of web sites.", "soft skill": "no"}
{"text": "This position will analyze search engine data and establish an on-going plan of further growth and refinement.", "soft skill": "no"}
{"text": "The web developer will work closely with outside SEO contractors and web development consultants to execute web site content, graphics, performance, and capacity.", "soft skill": "no"}
{"text": "This is an exciting position for an individual who wants to spread their wings in seeing how far and deep they can impact ecommerce and website SEO.", "soft skill": "no"}
{"text": "Having a national customer base for the resale of goods and custom manufactured goods.", "soft skill": "no"}
{"text": "You are working with a team and company that are heavily vested in continued growth.", "soft skill": "no"}
{"text": "You are encouraged to find new, fresh and out-of-the box approaches.", "soft skill": "no"}
{"text": "Knowledge, Skills, and Abilities", "soft skill": "no"}
{"text": "Strong operating knowledge of WordPress, Shopify and related website development tools", "soft skill": "no"}
{"text": "HTML, CSS and Javascript coding expertise", "soft skill": "no"}
{"text": "Capacity to utilize Google analytics and SEO tools", "soft skill": "no"}
{"text": "Strong analytical and problem-solving skills", "soft skill": "no"}
{"text": "Technically proficient with experience using a variety of software tools", "soft skill": "no"}
{"text": "Performance Responsibilities", "soft skill": "no"}
{"text": "Design, build, or maintain web sites, using authoring or scripting languages, content creation tools, management tools, and digital media.", "soft skill": "no"}
{"text": "Perform or direct web site updates.", "soft skill": "no"}
{"text": "Write, design, or edit web page content, or direct others producing content.", "soft skill": "no"}
{"text": "Back up files from web sites to local directories for instant recovery in case of problems.", "soft skill": "no"}
{"text": "Evaluate code to ensure that it is valid, is properly structured, meets industry standards and is compatible with browsers, devices, or operating systems.", "soft skill": "no"}
{"text": "Maintain understanding of current web technologies or programming practices through continuing education, reading, or participation in professional conferences, workshops, or groups.", "soft skill": "no"}
{"text": "Develop or validate test routines and schedules to ensure that test cases mimic external interfaces and address all browser and device types.", "soft skill": "no"}
{"text": "Renew domain name registrations.", "soft skill": "no"}
{"text": "Write supporting code for web applications or web sites.", "soft skill": "no"}
{"text": "Perform web site tests according to planned schedules, or after any web site or product revisions.", "soft skill": "no"}
{"text": "Develop and document style guidelines for web site content.", "soft skill": "no"}
{"text": "Identify or maintain links to and from other web sites and check links to ensure proper functioning.", "soft skill": "no"}
{"text": "Create searchable indices for web page content.", "soft skill": "no"}
{"text": "Register web sites with search engines to increase web site traffic.", "soft skill": "no"}
{"text": "Provide clear, detailed descriptions of web site specifications such as product features, activities, software, communication protocols, programming languages, and operating systems software and hardware.", "soft skill": "no"}
